vonnieda/esp32-flight-tracker/sdkconfig.defaults
# WT32-SC01 Plus (ESP32-S3, 16MB QIO flash, 2MB QSPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y

# IDF's defaults leave real perf on the table for a UI-heavy app: CPU clocked
# at 160MHz instead of the S3's max 240MHz, and the app compiled at IDF's
# default -Og (Debug) instead of -O2. LVGL's software renderer is CPU-bound,
# so both matter a lot here. "Performance" keeps assertions enabled (unlike
# IDF's "Release" preset), which is a reasonable tradeoff for a hobby project
# still under active development.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL wants a decently sized main task stack; the UI + touch handling run on it.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_FREERTOS_HZ=1000

# WiFi/TLS/HTTP/JSON push the app past the default 1MB app partition.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# LVGL's own built-in sprintf doesn't format floats correctly; use the C
# library's instead (see main/radar_view.cpp's range label for why this
# matters).
CONFIG_LV_USE_CLIB_SPRINTF=y
